Description: ''
Identifier: com.github.smithjw-actions.download.Karabiner_Elements
MinimumVersion: '2.3'

Input:
  NAME: Karabiner-Elements
  SOFTWARE_TITLE: karabiner_elements
  INCLUDE_PRERELEASES: null
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: 'False'

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: 'Karabiner-Elements-.*\.dmg'
      github_repo: pqrs-org/Karabiner-Elements
      include_prereleases: '%INCLUDE_PRERELEASES%'

  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%-%version%.dmg'

  - Processor: EndOfCheckPhase

  - Processor: StopProcessingIf
    Arguments:
      predicate: 'download_changed == %BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Fumihiko Takayama (G43BCU2T37)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%/Karabiner-Elements.pkg'
