Description: Downloads the latest Microsoft 365 Copilot installer pkg using the URLDownloaderPython processor.
Identifier: com.github.smithjw-actions.download.Microsoft_365_Copilot
MinimumVersion: '2.3'

Input:
  NAME: Microsoft 365 Copilot
  SOFTWARE_TITLE: Microsoft_365_Copilot
  DOWNLOAD_URL: https://go.microsoft.com/fwlink/?linkid=2325438&clcid=0x409&culture=en-us&country=us
  DOWNLOAD_MISSING_FILE: null
  BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED: null

Process:
  - Processor: com.github.smithjw-actions.processors/URLDownloaderPython
    Arguments:
      download_missing_file: '%DOWNLOAD_MISSING_FILE%'
      filename: '%SOFTWARE_TITLE%.pkg'
      url: '%DOWNLOAD_URL%'

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/StopProcessingIfDownloadUnchanged
    Arguments:
      bypass_stop_processing_if: '%BYPASS_STOP_PROCESSING_IF_DOWNLOAD_UNCHANGED%'

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Microsoft Corporation (UBF8T346G9)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
