Description: ''
Identifier: com.github.smithjw-actions.jamf.upload.OpenAI_Codex
ParentRecipe: com.github.smithjw-actions.pkg.OpenAI_Codex
MinimumVersion: '2.3'

Input:
  NAME: OpenAI Codex
  SOFTWARE_TITLE: OpenAI_Codex
  CATEGORY: Developer
  PACKAGE_INFO: autopkg
  PKG_NAME_MATCH: '%SOFTWARE_TITLE%-'
  PKG_TO_KEEP: '2'
  REMOVE_OLD_PACKAGES: 'true'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'
      pkg_info: '%PACKAGE_INFO%'

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%REMOVE_OLD_PACKAGES% == false'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: '%PKG_NAME_MATCH%'
      versions_to_keep: '%PKG_TO_KEEP%'
