Description: Downloads the latest version of OpenAI Codex and creates a package.
Identifier: com.github.smithjw-actions.pkg.OpenAI_Codex
ParentRecipe: com.github.smithjw-actions.download.OpenAI_Codex
MinimumVersion: '2.3'

Input:
  NAME: OpenAI Codex
  SOFTWARE_TITLE: OpenAI_Codex

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/payload'
      pkgdirs:
        pkgroot: '0775'
        scripts: '0775'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/unpack-arm64/codex'
      destination_path: '%RECIPE_CACHE_DIR%/payload/scripts/codex-arm64'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/unpack-x86_64/codex'
      destination_path: '%RECIPE_CACHE_DIR%/payload/scripts/codex-x86_64'

  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/payload/scripts/postinstall'
      file_mode: '0755'
      file_content: |
        #!/bin/bash

        logged_in_user=$( /usr/sbin/scutil <<< "show State:/Users/ConsoleUser" | /usr/bin/awk '/Name :/ && ! /loginwindow/ { print $3 }' )
        logged_in_user_uid=$(/usr/bin/id -u "$logged_in_user")
        log_prefix="CODEX_POSTINSTALL"

        function echo_logger() {
            # echo_logger version 1.1
            log_folder="${log_folder:=/private/var/log}"
            /bin/mkdir -p "$log_folder"
            echo -e "$(/bin/date +'%Y-%m-%d %T%z') - ${log_prefix:+$log_prefix }${1}" | /usr/bin/tee -a "$log_folder/${log_name:=management.log}"
        }

        if [[ -z "$logged_in_user" ]] || [[ "$logged_in_user" =~ (loginwindow|_mbsetupuser|root) ]]; then
            echo_logger "No user logged in, exiting."
            exit 1
        else
            echo_logger "Installing for user: $logged_in_user (UID: $logged_in_user_uid)"
            logged_in_user_home=$( /usr/bin/dscl . -read /users/"$logged_in_user" NFSHomeDirectory | /usr/bin/cut -d " " -f 2 )
            LOCAL_USER_CODEX_DIR="$logged_in_user_home/.codex"
            LOCAL_USER_BIN_DIR="$logged_in_user_home/.local/bin"

            echo_logger "Creating directories:"
            echo_logger "  - $LOCAL_USER_CODEX_DIR"
            echo_logger "  - $LOCAL_USER_BIN_DIR"
            /bin/mkdir -p "$LOCAL_USER_CODEX_DIR" "$LOCAL_USER_BIN_DIR"
            /usr/sbin/chown "$logged_in_user_uid":staff "$LOCAL_USER_CODEX_DIR" "$LOCAL_USER_BIN_DIR"
            /bin/chmod 755 "$LOCAL_USER_CODEX_DIR" "$LOCAL_USER_BIN_DIR"
        fi

        if [[ $( /usr/bin/arch ) = arm64* ]]; then
          echo_logger "Copying arm64 version into place & setting permissions"
          /bin/cp codex-arm64 "$LOCAL_USER_BIN_DIR/codex"
          /usr/sbin/chown "$logged_in_user_uid":staff "$LOCAL_USER_BIN_DIR/codex"
          /bin/chmod +x "$LOCAL_USER_BIN_DIR/codex"
        else
          echo_logger "Copying x86_64 version into place & setting permissions"
          /bin/cp codex-x86_64 "$LOCAL_USER_BIN_DIR/codex"
          /usr/sbin/chown "$logged_in_user_uid":staff "$LOCAL_USER_BIN_DIR/codex"
          /bin/chmod +x "$LOCAL_USER_BIN_DIR/codex"
        fi

        exit 0

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: com.openai.codex
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%SOFTWARE_TITLE%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/payload/pkgroot'
        scripts: '%RECIPE_CACHE_DIR%/payload/scripts'
        version: '%version%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/payload'
        - '%RECIPE_CACHE_DIR%/unpack-arm64'
        - '%RECIPE_CACHE_DIR%/unpack-x86_64'
